{"class_name": "Model", "keras_version": "1.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "input_dtype": "float32", "sparse": false, "name": "word_input"}, "inbound_nodes": [], "name": "word_input"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "word_emb", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 3309, "batch_input_shape": [null, 100], "W_regularizer": null, "dropout": 0.2, "output_dim": 100, "input_length": 100}, "inbound_nodes": [[["word_input", 0, 0]]], "name": "word_emb"}, {"class_name": "ZeroPadding1D", "config": {"padding": 5, "trainable": true, "name": "zeropadding1d_1"}, "inbound_nodes": [[["word_emb", 0, 0]]], "name": "zeropadding1d_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 11, "init": "glorot_uniform", "bias": true, "nb_filter": 50, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["zeropadding1d_1", 0, 0]]], "name": "convolution1d_1"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "forward_lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.1, "dropout_W": 0.1, "input_dim": 100, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 100, "forget_bias_init": "one", "input_length": null}}, "trainable": true, "name": "bidirectional_1"}, "inbound_nodes": [[["word_emb", 0, 0]]], "name": "bidirectional_1"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "dropout_2"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["bidirectional_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "timedistributed_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": 2, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_1", 0, 0], ["timedistributed_1", 0, 0]]], "name": "merge_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 14}}, "trainable": true, "name": "timedistributed_2"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "timedistributed_2"}, {"class_name": "ChainCRF", "config": {"U_regularizer": null, "b_constraint": null, "name": "chaincrf_1", "U_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}, "inbound_nodes": [[["timedistributed_2", 0, 0]]], "name": "chaincrf_1"}], "input_layers": [["word_input", 0, 0]], "output_layers": [["chaincrf_1", 0, 0]], "name": "model_1"}}