 state：1 
 
【日志级别】FATAL 
【记录时间】16:54:45,898  
【描    述】用户状态变化用户名：刘礼  用户ID：P150043174205343   state：1 
 
【日志级别】FATAL 
【记录时间】16:57:11,454  
【描    述】用户状态变化用户名：黄宇琪  用户ID：P147384011673695   state：1 
 
【日志级别】FATAL 
【记录时间】16:57:39,404  
【描    述】用户状态变化用户名：张满玲  用户ID：1011100000000000245   state：0 
 
【日志级别】FATAL 
【记录时间】16:58:05,511  
【描    述】用户状态变化用户名：王国威  用户ID：P149628803543017   state：1 
 
【日志级别】FATAL 
【记录时间】16:59:51,218  
【描    述】用户状态变化用户名：王立成  用户ID：P147384011612737   state：1 
 
【日志级别】FATAL 
【记录时间】17:00:24,418  
【描    述】用户状态变化用户名�